# [Einführung Pandas] Pandas DataFrame

In [2]:
import pandas as pd

## Von Series zu DataFrame

In [3]:
# Angabe Umsatz, Ergebnis und Börsenwert in Mrd. EUR zum Fiskaljahr 2022

In [4]:
airbus = pd.Series([59,5.2,101, 134267], 
                   index=["umsatz", "ergebnis", "börsenwert", "mitarbeiter"], 
                   name="Airbus")


boeing = pd.Series([66,-3.5,114, 156000], 
                   index=["umsatz", "ergebnis", "börsenwert", "mitarbeiter"], 
                   name="Boeing")

In [5]:
print(airbus)
print(boeing)

umsatz             59.0
ergebnis            5.2
börsenwert        101.0
mitarbeiter    134267.0
Name: Airbus, dtype: float64
umsatz             66.0
ergebnis           -3.5
börsenwert        114.0
mitarbeiter    156000.0
Name: Boeing, dtype: float64

In [6]:
print(type(airbus))
print(type(boeing))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

### Umwandlung

In [7]:
print(type(pd.concat([airbus, boeing])))

<class 'pandas.core.series.Series'>

In [18]:
airbus_boeing_df = pd.merge(airbus, boeing, right_index=True, left_index=True)

In [9]:
print(airbus_boeing_df)

               Airbus    Boeing
umsatz           59.0      66.0
ergebnis          5.2      -3.5
börsenwert      101.0     114.0
mitarbeiter  134267.0  156000.0

In [10]:
airbus_boeing_df

               Airbus    Boeing
umsatz           59.0      66.0
ergebnis          5.2      -3.5
börsenwert      101.0     114.0
mitarbeiter  134267.0  156000.0

In [11]:
print(type(airbus_boeing_df))

<class 'pandas.core.frame.DataFrame'>

## DataFrame erstellen

In [12]:
pd.DataFrame(data = [100, 200, 300, 400])

     0
0  100
1  200
2  300
3  400

In [13]:
pd.DataFrame(data = [100, 200, 300, 400], index = ["index1", "index2", "index3", "index4"])

          0
index1  100
index2  200
index3  300
index4  400

In [14]:
pd.DataFrame(data = {"überschrift1":[100, 200, 300, 400]}, index = ["index1", "index2", "index3", "index4"])

        überschrift1
index1           100
index2           200
index3           300
index4           400

### Beispiel: Airbus und Boeing

In [15]:
airbus_boeing_df.transpose()

        umsatz  ergebnis  börsenwert  mitarbeiter
Airbus    59.0       5.2       101.0     134267.0
Boeing    66.0      -3.5       114.0     156000.0

In [16]:
pd.DataFrame([airbus, boeing]).transpose()

               Airbus    Boeing
umsatz           59.0      66.0
ergebnis          5.2      -3.5
börsenwert      101.0     114.0
mitarbeiter  134267.0  156000.0

In [17]:
pd.DataFrame(data = {"airbus" : [59, 5.2, 101, 134267], 
                    "boeing" : [66, -3.5, 114, 156000]}, 
             index = ["umsatz", "ergebnis", "börsenwert", "mitarbeiter"]).transpose()

        umsatz  ergebnis  börsenwert  mitarbeiter
airbus    59.0       5.2       101.0     134267.0
boeing    66.0      -3.5       114.0     156000.0